Revit 2027 API
Rectangle.Left Property
 The x-coordinate of the top-left corner of the rectangle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Left { get; set; }
Public Property Left As Integer
	Get
	Set
public:
property int Left {
	int get ();
	void set (int value);
}
member Left : int with get, set
Property Value
Int32
See Also
Reference
Rectangle Class
Autodesk.Revit.DB Namespace